<?php
// +---------------------------------------------------------------------------------------------------------------------------
// | 本文件是《FastAdmin客服系统》的一部分，所有代码、文字、图片、样式、风格等版权归作者所有，如有复制、仿冒、抄袭、盗用，FastAdmin和作者将追究法律责任
// +---------------------------------------------------------------------------------------------------------------------------
// | @作者: 妙码生花 <1094963513@qq.com>
// +---------------------------------------------------------------------------------------------------------------------------
// | @唯一授权链接: https://www.fastadmin.net/store/kefu.html
// +---------------------------------------------------------------------------------------------------------------------------

use think\App;
use think\Console;

// 定义项目路径
define('APP_PATH', __DIR__ . '/../../../../application/');

// 加载框架引导文件
require __DIR__ . '/../../../../thinkphp/base.php';

// 执行应用
App::initCommon();
Console::init(false);
Console::call('WorkerStartForWin', ['gateway']);